org-roam/winkler98_compos_inter_music.org
:PROPERTIES:
:ID:       f7f10461-bb73-4bb0-95d1-1f2f3d1f00dc
:ROAM_REFS: cite:winkler98_compos_inter_music
:END:
#+TITLE: winkler98_compos_inter_music

* Composing interactive music: techniques and ideas using max
:PROPERTIES:
:Custom_ID: winkler98_compos_inter_music
:URL: 
:AUTHOR: Winkler, T.
:NOTER_DOCUMENT: 
:NOTER_PAGE:
:END:

** Chapter 1: Introduction and Background
*** page 4
=Interactive music is defined as music composition or improvisation where software interprets a live performance to affect music generated or modified by computers. Usually this involves a performer playing an instrument while a computer creates music that is in some way shaped by the performance.=

*** page 6                                                            :inter:
 Look at Rowe 1993 source

 Five steps to creating an interactive piece:

 1. Human input, instruments - Human activity is translated into digital information and sent to the computer.
 2. Computer listening, performance analysis - The computer receives the human input and analyzes the performance information for timing, pitch, dynamics, or other musical characteristics.
 3. Interpretation - The software interprets the computer listener information, generating data that will influence the composition.
 4. Computer composition - Computer processes, responsible for all aspects of the computer generated music, are based on the results of the computer's interpretation of the performance.
 5. Sound generation and output, performance - The computer plays the music, using sounds created internally, or by sending musical information to devices that generate sound.

 following pages contain history and possibly philosophy

*** page 7                                                      :performance:
  Traditional notation only gives a loose sense of how to perform music. Much is left to the sensibilities of the performer. Programs have done a lot to add musicality to computers, but they are still far from the expressive capabilities of a human performer.
*** page 8                                                :performance:inter:
  In live performance, a computer can take on elements of human musicality, and the computer can give the performer the ability to surpass the physical limitations of their instrument.
*** page 9-19                                                       :history:
  Interaction was originally in music, and has been on the decline. Recordings took away the interaction of performer and audience. Multitrack recording took away the interaction of performers with each other, as they could be layered on top of each other. Pop concerts may even have the performers lip singing so the performance sounds as close to the recording as possible. Computer music did not begin interactively, as the computers could not process calculations fast enough for live performance. However when the programming was done, some people didn't like the lack of a visual component of the music. Putting a performer next to them helped, but then it became hard for the performer because there was no interaction on their end. Thus began the experiments in interactive electronic music.

 Early experiments were forms of taking acoustic signals and delaying them or using other simple effects. As microphones became available, it became much easier to use traditional instruments with the computer.

 In the 80s, personal computers were more affordable, more powerful, and enabled many musicians to create music without needing to be at a large institution. Instrument manufacturers agreed on the Musical Instrument Digital Interface as a universal standard. Composers figured out how to get computers to do things in real time, follow scores, or recognize musical input.

 Joel Chadabe formed a company called Intelligent Music that designed some of the first peformance software, M and Jam Factory. This software was successfully used in performance as well. Others created other software like Cypher, Kyma, and Dmix. They all worked with MIDI data, although Kyma added some sythesis and processing capabilities. Max is by far the most used of this kind of software.

 Max was developed by Miller Puckette and others at IRCAM in Paris. The goal was synthesis and signal processing. It was relatively simple to create interactive works for keyboard instruments, since each key is its own switch and trigger, but it took a great deal longer for other instruments. Pitch detectors were unreliable at first. It took 3 years to make the first pieces for a flute and max with score following techniques.

 Max split in two directions, one focused on being available for consumers, and one on better interaction with IRCAM hardware. This second direction became obsolete because the computer system it relied on became extinct.

 Miller then merged the two systems and created Pure Data, adding video processing as well. 
** Chapter 2: Interaction: Defining Relationships between Computers and Performers
*** Performance Models
