docs/site/winkler98_compos_inter_music.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>winkler98_compos_inter_music</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">winkler98_compos_inter_music</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#winkler98_compos_inter_music">Composing interactive music: techniques and ideas using max</a>
<ul>
<li><a href="#org129deae">Chapter 1: Introduction and Background</a>
<ul>
<li><a href="#orgf30c46b">page 4</a></li>
<li><a href="#orga3ee75e">page 6&#xa0;&#xa0;&#xa0;<span class="tag"><span class="inter">inter</span></span></a></li>
<li><a href="#org758c173">page 7&#xa0;&#xa0;&#xa0;<span class="tag"><span class="performance">performance</span></span></a></li>
<li><a href="#org3b709bc">page 8&#xa0;&#xa0;&#xa0;<span class="tag"><span class="performance">performance</span>&#xa0;<span class="inter">inter</span></span></a></li>
<li><a href="#org331b714">page 9-19&#xa0;&#xa0;&#xa0;<span class="tag"><span class="history">history</span></span></a></li>
</ul>
</li>
<li><a href="#org5628202">Chapter 2: Interaction: Defining Relationships between Computers and Performers</a>
<ul>
<li><a href="#orgb69cc92">Performance Models</a></li>
</ul>
</li>
<li><a href="#org9f1bc7c">Chapter 3: Graphic Programming with Max</a>
<ul>
<li><a href="#orge202810">page 63&#xa0;&#xa0;&#xa0;<span class="tag"><span class="midi">midi</span></span></a></li>
<li><a href="#orga64d172">page 65&#xa0;&#xa0;&#xa0;<span class="tag"><span class="midi">midi</span></span></a></li>
<li><a href="#orgf41fcf4">page 66</a></li>
<li><a href="#org67f5805">page 67&#xa0;&#xa0;&#xa0;<span class="tag"><span class="midi">midi</span></span></a></li>
<li><a href="#org9390997">page 68&#xa0;&#xa0;&#xa0;<span class="tag"><span class="midi">midi</span></span></a></li>
<li><a href="#orgd1d4a37">page 69&#xa0;&#xa0;&#xa0;<span class="tag"><span class="midi">midi</span></span></a></li>
</ul>
</li>
<li><a href="#orga5a31d4">Chapter 6: The Computer as Listener: Analyzing and Storing Performance Data</a>
<ul>
<li><a href="#orge66fb7a">page 135</a></li>
<li><a href="#org15831bd">page 136</a></li>
<li><a href="#org8772787">page 137</a></li>
<li><a href="#orgff2c0cf">page 138</a></li>
<li><a href="#orga47fb1b">page 140</a></li>
<li><a href="#orgfe49059">page 142</a></li>
<li><a href="#orgb71260e">page 145</a></li>
<li><a href="#org41b3c78">page 151</a></li>
<li><a href="#orge0776b2">page 155</a></li>
<li><a href="#orga3d6a5b">page 156</a></li>
<li><a href="#orgaae6ea1">page 157</a></li>
<li><a href="#orgf9c3d3c">page 161</a></li>
<li><a href="#orge4f6c27">page 164</a></li>
<li><a href="#org04490ff">page 165+</a></li>
<li><a href="#org3c0c89a">page 172</a></li>
</ul>
</li>
<li><a href="#org11ef8ec">Chapter 7: Composer Objects</a>
<ul>
<li><a href="#orge8751ab">page 174</a></li>
<li><a href="#org6fdc5ee">page 175</a></li>
<li><a href="#org6bd0c77">page 176</a></li>
<li><a href="#orgbc47eae">page 176</a></li>
<li><a href="#orgb6bf028">page 178</a></li>
<li><a href="#org1448257">pages 179-186</a></li>
<li><a href="#org76b2ef6">pages 187- 190</a></li>
<li><a href="#org7faca36">page 191</a></li>
<li><a href="#org732d2b6">page 210</a></li>
</ul>
</li>
<li><a href="#org91690c2">Chapter 8: Sound Design</a>
<ul>
<li><a href="#org2956175">page 221</a></li>
<li><a href="#org61f9272">page 225</a></li>
<li><a href="#org1c4b82a">page 257</a></li>
</ul>
</li>
<li><a href="#orga142984">Chapter 9: Score Objects: Compositional Strategies, Structures, and Timing Mechanisms</a>
<ul>
<li><a href="#org6227bf3">page 259</a></li>
<li><a href="#orgbf981ec">page 260</a></li>
<li><a href="#orgcfac01d">page 261</a></li>
<li><a href="#org0919f64">page 264</a></li>
<li><a href="#orgde0defa">page 266</a></li>
<li><a href="#org8e2f2d1">page 269</a></li>
<li><a href="#org8d58b81">page 275</a></li>
<li><a href="#orgb04801d">page 284</a></li>
<li><a href="#orge40b254">page 291</a></li>
<li><a href="#org7065823">page 292</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-winkler98_compos_inter_music" class="outline-2">
<h2 id="winkler98_compos_inter_music">Composing interactive music: techniques and ideas using max</h2>
<div class="outline-text-2" id="text-winkler98_compos_inter_music">
</div>
<div id="outline-container-org129deae" class="outline-3">
<h3 id="org129deae">Chapter 1: Introduction and Background</h3>
<div class="outline-text-3" id="text-org129deae">
</div>
<div id="outline-container-orgf30c46b" class="outline-4">
<h4 id="orgf30c46b">page 4</h4>
<div class="outline-text-4" id="text-orgf30c46b">
<p>
<code>Interactive music is defined as music composition or improvisation where software interprets a live performance to affect music generated or modified by computers. Usually this involves a performer playing an instrument while a computer creates music that is in some way shaped by the performance.</code>
</p>
</div>
</div>
<div id="outline-container-orga3ee75e" class="outline-4">
<h4 id="orga3ee75e">page 6&#xa0;&#xa0;&#xa0;<span class="tag"><span class="inter">inter</span></span></h4>
<div class="outline-text-4" id="text-orga3ee75e">
<p>
Look at Rowe 1993 source
</p>

<p>
Five steps to creating an interactive piece:
</p>

<ol class="org-ol">
<li>Human input, instruments - Human activity is translated into digital information and sent to the computer.</li>
<li>Computer listening, performance analysis - The computer receives the human input and analyzes the performance information for timing, pitch, dynamics, or other musical characteristics.</li>
<li>Interpretation - The software interprets the computer listener information, generating data that will influence the composition.</li>
<li>Computer composition - Computer processes, responsible for all aspects of the computer generated music, are based on the results of the computer's interpretation of the performance.</li>
<li>Sound generation and output, performance - The computer plays the music, using sounds created internally, or by sending musical information to devices that generate sound.</li>
</ol>

<p>
following pages contain history and possibly philosophy
</p>
</div>
</div>
<div id="outline-container-org758c173" class="outline-4">
<h4 id="org758c173">page 7&#xa0;&#xa0;&#xa0;<span class="tag"><span class="performance">performance</span></span></h4>
<div class="outline-text-4" id="text-org758c173">
<p>
Traditional notation only gives a loose sense of how to perform music. Much is left to the sensibilities of the performer. Programs have done a lot to add musicality to computers, but they are still far from the expressive capabilities of a human performer.
</p>
</div>
</div>
<div id="outline-container-org3b709bc" class="outline-4">
<h4 id="org3b709bc">page 8&#xa0;&#xa0;&#xa0;<span class="tag"><span class="performance">performance</span>&#xa0;<span class="inter">inter</span></span></h4>
<div class="outline-text-4" id="text-org3b709bc">
<p>
In live performance, a computer can take on elements of human musicality, and the computer can give the performer the ability to surpass the physical limitations of their instrument.
</p>
</div>
</div>
<div id="outline-container-org331b714" class="outline-4">
<h4 id="org331b714">page 9-19&#xa0;&#xa0;&#xa0;<span class="tag"><span class="history">history</span></span></h4>
<div class="outline-text-4" id="text-org331b714">
<p>
Interaction was originally in music, and has been on the decline. Recordings took away the interaction of performer and audience. Multitrack recording took away the interaction of performers with each other, as they could be layered on top of each other. Pop concerts may even have the performers lip singing so the performance sounds as close to the recording as possible. Computer music did not begin interactively, as the computers could not process calculations fast enough for live performance. However when the programming was done, some people didn't like the lack of a visual component of the music. Putting a performer next to them helped, but then it became hard for the performer because there was no interaction on their end. Thus began the experiments in interactive electronic music.
</p>

<p>
Early experiments were forms of taking acoustic signals and delaying them or using other simple effects. As microphones became available, it became much easier to use traditional instruments with the computer.
</p>

<p>
In the 80s, personal computers were more affordable, more powerful, and enabled many musicians to create music without needing to be at a large institution. Instrument manufacturers agreed on the Musical Instrument Digital Interface as a universal standard. Composers figured out how to get computers to do things in real time, follow scores, or recognize musical input.
</p>

<p>
Joel Chadabe formed a company called Intelligent Music that designed some of the first peformance software, M and Jam Factory. This software was successfully used in performance as well. Others created other software like Cypher, Kyma, and Dmix. They all worked with MIDI data, although Kyma added some sythesis and processing capabilities. Max is by far the most used of this kind of software.
</p>

<p>
Max was developed by Miller Puckette and others at IRCAM in Paris. The goal was synthesis and signal processing. It was relatively simple to create interactive works for keyboard instruments, since each key is its own switch and trigger, but it took a great deal longer for other instruments. Pitch detectors were unreliable at first. It took 3 years to make the first pieces for a flute and max with score following techniques.
</p>

<p>
Max split in two directions, one focused on being available for consumers, and one on better interaction with IRCAM hardware. This second direction became obsolete because the computer system it relied on became extinct.
</p>

<p>
Miller then merged the two systems and created Pure Data, adding video processing as well. 
</p>
</div>
</div>
</div>
<div id="outline-container-org5628202" class="outline-3">
<h3 id="org5628202">Chapter 2: Interaction: Defining Relationships between Computers and Performers</h3>
<div class="outline-text-3" id="text-org5628202">
</div>
<div id="outline-container-orgb69cc92" class="outline-4">
<h4 id="orgb69cc92">Performance Models</h4>
<div class="outline-text-4" id="text-orgb69cc92">
</div>
<ul class="org-ul">
