org-roam/winkler98_compos_inter_music.org
**** Page 22
     Interactive pieces can create improvisational responses because of their flexible structures based on musical input. The composer relinquishes some control to increase the performer's engagement and spontaneity.

     Part of the appeal of live performance is the drama of who is in charge, and the balance of roles. Composers create the role the computer and performer have in this balance.
**** Conductor Model - Symphony Orchestra (23)
     The conductor is in charge, but has to listen to the orchestra as well.
     Many of the first interactive pieces were based on this model, allowing real time control of the tempo through a glove, or baton, or following one players music
**** Chamber Music Model - String Quartet (25)
     While there is a leader, usually control is shared by everyone in the group. This passing of control adds to the drama.
     Some early pieces have dynamic controls and parts where the computer is more important and parts where the performer is more important.
**** Improvisation Model - Jazz Combo (25)
     There is a basic structure that allows nearly unlimited freedom within it. Through many years of experience there are certain licks or styles that are more appropriate to the style.
     Computers can recognize patterns, scales, chord progressions, tempi, etc. Then it can generate new music based on those features.
**** Free Improvisation
     Sometimes no one is in control. All involved have influence on what the others say, but no one has the final say.
**** Indeterminacy (29)
     Indeterminate actions create more spontaneity, expressiveness, and interactivity
**** The rest of the chapter deals with opposite extremes of musical structure, like linear vs non linear, etc.
** Chapter 3: Graphic Programming with Max 
*** page 63                                                            :midi:
 How Max Handles MIDI

 detailed description of midi messages and bits and bytes, also why 127

*** page 65                                                            :midi:
 notein and noteout
 note on and note off
*** page 66
 stripnote
 makenote
*** page 67                                                            :midi:
 continuous controllers
 ctlin ctlout
*** page 68                                                            :midi:
 can be remapped for lots of things

 program change
 "voice" or banks
*** page 69                                                            :midi:
 pgmin pgmout
 complete midi info with midiin midiparse midiout seq
** Chapter 6: The Computer as Listener: Analyzing and Storing Performance Data
*** page 135
    A listener's understanding of music is shaped by past memories and associations triggered by the music as well as the listener's general concept of music. A computer does not have emotions, but it can still compare an on-going performance to previous music that is has stored. This could be patterns of pitches and dynamics, or much more complex patterns like keys, chord types, transpositions, etc.
*** page 136
    What can a computer hear? When dealing with MIDI there is pitch, velocity, and time. Timbre perhaps can be mapped to continuous controllers, but is not explicitly defined in MIDI
*** page 137
    The first step is establishing what performance data is needed, and how they can be separated and understood by the computer.
    | Time |
*** page 138
    Flexible timing between performer and computer is an important part of simulating musical interaction.
    *Metro* and *Tempo* are max objects that output bangs at a specific rate, usually the tempo of the music
    *Timer* and *Clocker* count miliseconds. Bang the timer starts it, the next bang outputs the time it took. This tells you the time in between events. Clocker outputs it's elapsed time at a specific rate.
*** page 140
    Analysis is "delta time" - the time between events, and "note duration" - the time from a key press to its release, even if sound continues past that. You can use note on and off messages to trigger timers that will give each parameter (at least for MIDI instruments)
*** page 142
    A MIDI sustain pedal can be used to tap the tempo and not be affected by the rhythms of other notes
*** page 145
    borax is the swiss army knife of timing midi messages from notein, there are several other models receiving MIDI input and looking at deltas to control tempo, and adjust for small errors
    | Rhythm Analysis| 
*** page 151
    There are many human errors that need extra programming for max to handle correctly. There could be a double trigger by hitting two keys at once, weird finger combinations on other instruments, etc. Double tonguing for unlcear attack etc. Pitch to midi converters struggle with unstable pitch, strong overtones, vibrato, etc. One option to help is *speedlim* that only outputs data at specified intervals
    | Pitch|
*** page 155
    The modulo operator can be used to analyze pitch class to perhaps look at themes.
*** page 156
    Intervals are used by subtracting midi note values from the previous note. The sign gives the direction. *abs* takes the absolute value if direction doesn't matter. Register can be found by dividing by 12 and subtracting an offset.
*** page 157
    Harmonies can be analyzed by grouping notes played closely enough together as a chord instead of individual notes. *tresh* groups items into a list if they happen close together, then you can sort the list, compare intervals, and then compare those chords to a collection of known chords.
*** page 161
    *select* and *match* look for patterns. *past* and *peak* trigger when something gets too high, or remembers the highest respectively. The opposite of peak is *trough*
