docs/site/winkler98_compos_inter_music.html
<li><a id="org98e3392"></a>Page 22<br />
<div class="outline-text-5" id="text-org98e3392">
<p>
Interactive pieces can create improvisational responses because of their flexible structures based on musical input. The composer relinquishes some control to increase the performer's engagement and spontaneity.
</p>

<p>
Part of the appeal of live performance is the drama of who is in charge, and the balance of roles. Composers create the role the computer and performer have in this balance.
</p>
</div>
</li>
<li><a id="org5621ba9"></a>Conductor Model - Symphony Orchestra (23)<br />
<div class="outline-text-5" id="text-org5621ba9">
<p>
The conductor is in charge, but has to listen to the orchestra as well.
Many of the first interactive pieces were based on this model, allowing real time control of the tempo through a glove, or baton, or following one players music
</p>
</div>
</li>
<li><a id="org5ed3b75"></a>Chamber Music Model - String Quartet (25)<br />
<div class="outline-text-5" id="text-org5ed3b75">
<p>
While there is a leader, usually control is shared by everyone in the group. This passing of control adds to the drama.
Some early pieces have dynamic controls and parts where the computer is more important and parts where the performer is more important.
</p>
</div>
</li>
<li><a id="org7a7a229"></a>Improvisation Model - Jazz Combo (25)<br />
<div class="outline-text-5" id="text-org7a7a229">
<p>
There is a basic structure that allows nearly unlimited freedom within it. Through many years of experience there are certain licks or styles that are more appropriate to the style.
Computers can recognize patterns, scales, chord progressions, tempi, etc. Then it can generate new music based on those features.
</p>
</div>
</li>
<li><a id="orgbf93f33"></a>Free Improvisation<br />
<div class="outline-text-5" id="text-orgbf93f33">
<p>
Sometimes no one is in control. All involved have influence on what the others say, but no one has the final say.
</p>
</div>
</li>
<li><a id="orgb6453c5"></a>Indeterminacy (29)<br />
<div class="outline-text-5" id="text-orgb6453c5">
<p>
Indeterminate actions create more spontaneity, expressiveness, and interactivity
</p>
</div>
</li>
<li><a id="org8da4c55"></a>The rest of the chapter deals with opposite extremes of musical structure, like linear vs non linear, etc.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org9f1bc7c" class="outline-3">
<h3 id="org9f1bc7c">Chapter 3: Graphic Programming with Max</h3>
<div class="outline-text-3" id="text-org9f1bc7c">
</div>
<div id="outline-container-orge202810" class="outline-4">
<h4 id="orge202810">page 63&#xa0;&#xa0;&#xa0;<span class="tag"><span class="midi">midi</span></span></h4>
<div class="outline-text-4" id="text-orge202810">
<p>
How Max Handles MIDI
</p>

<p>
detailed description of midi messages and bits and bytes, also why 127
</p>
</div>
</div>
<div id="outline-container-orga64d172" class="outline-4">
<h4 id="orga64d172">page 65&#xa0;&#xa0;&#xa0;<span class="tag"><span class="midi">midi</span></span></h4>
<div class="outline-text-4" id="text-orga64d172">
<p>
notein and noteout
note on and note off
</p>
</div>
</div>
<div id="outline-container-orgf41fcf4" class="outline-4">
<h4 id="orgf41fcf4">page 66</h4>
<div class="outline-text-4" id="text-orgf41fcf4">
<p>
stripnote
makenote
</p>
</div>
</div>
<div id="outline-container-org67f5805" class="outline-4">
<h4 id="org67f5805">page 67&#xa0;&#xa0;&#xa0;<span class="tag"><span class="midi">midi</span></span></h4>
<div class="outline-text-4" id="text-org67f5805">
<p>
continuous controllers
ctlin ctlout
</p>
</div>
</div>
<div id="outline-container-org9390997" class="outline-4">
<h4 id="org9390997">page 68&#xa0;&#xa0;&#xa0;<span class="tag"><span class="midi">midi</span></span></h4>
<div class="outline-text-4" id="text-org9390997">
<p>
can be remapped for lots of things
</p>

<p>
program change
"voice" or banks
</p>
</div>
</div>
<div id="outline-container-orgd1d4a37" class="outline-4">
<h4 id="orgd1d4a37">page 69&#xa0;&#xa0;&#xa0;<span class="tag"><span class="midi">midi</span></span></h4>
<div class="outline-text-4" id="text-orgd1d4a37">
<p>
pgmin pgmout
complete midi info with midiin midiparse midiout seq
</p>
</div>
</div>
</div>
<div id="outline-container-orga5a31d4" class="outline-3">
<h3 id="orga5a31d4">Chapter 6: The Computer as Listener: Analyzing and Storing Performance Data</h3>
<div class="outline-text-3" id="text-orga5a31d4">
</div>
<div id="outline-container-orge66fb7a" class="outline-4">
<h4 id="orge66fb7a">page 135</h4>
<div class="outline-text-4" id="text-orge66fb7a">
<p>
A listener's understanding of music is shaped by past memories and associations triggered by the music as well as the listener's general concept of music. A computer does not have emotions, but it can still compare an on-going performance to previous music that is has stored. This could be patterns of pitches and dynamics, or much more complex patterns like keys, chord types, transpositions, etc.
</p>
</div>
</div>
<div id="outline-container-org15831bd" class="outline-4">
<h4 id="org15831bd">page 136</h4>
<div class="outline-text-4" id="text-org15831bd">
<p>
What can a computer hear? When dealing with MIDI there is pitch, velocity, and time. Timbre perhaps can be mapped to continuous controllers, but is not explicitly defined in MIDI
</p>
</div>
</div>
<div id="outline-container-org8772787" class="outline-4">
<h4 id="org8772787">page 137</h4>
<div class="outline-text-4" id="text-org8772787">
<p>
The first step is establishing what performance data is needed, and how they can be separated and understood by the computer.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Time</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgff2c0cf" class="outline-4">
<h4 id="orgff2c0cf">page 138</h4>
<div class="outline-text-4" id="text-orgff2c0cf">
<p>
Flexible timing between performer and computer is an important part of simulating musical interaction.
<b>Metro</b> and <b>Tempo</b> are max objects that output bangs at a specific rate, usually the tempo of the music
<b>Timer</b> and <b>Clocker</b> count miliseconds. Bang the timer starts it, the next bang outputs the time it took. This tells you the time in between events. Clocker outputs it's elapsed time at a specific rate.
</p>
</div>
</div>
<div id="outline-container-orga47fb1b" class="outline-4">
<h4 id="orga47fb1b">page 140</h4>
<div class="outline-text-4" id="text-orga47fb1b">
<p>
Analysis is "delta time" - the time between events, and "note duration" - the time from a key press to its release, even if sound continues past that. You can use note on and off messages to trigger timers that will give each parameter (at least for MIDI instruments)
</p>
</div>
</div>
<div id="outline-container-orgfe49059" class="outline-4">
<h4 id="orgfe49059">page 142</h4>
<div class="outline-text-4" id="text-orgfe49059">
<p>
A MIDI sustain pedal can be used to tap the tempo and not be affected by the rhythms of other notes
</p>
</div>
</div>
<div id="outline-container-orgb71260e" class="outline-4">
<h4 id="orgb71260e">page 145</h4>
<div class="outline-text-4" id="text-orgb71260e">
<p>
borax is the swiss army knife of timing midi messages from notein, there are several other models receiving MIDI input and looking at deltas to control tempo, and adjust for small errors
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Rhythm Analysis</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org41b3c78" class="outline-4">
<h4 id="org41b3c78">page 151</h4>
<div class="outline-text-4" id="text-org41b3c78">
<p>
There are many human errors that need extra programming for max to handle correctly. There could be a double trigger by hitting two keys at once, weird finger combinations on other instruments, etc. Double tonguing for unlcear attack etc. Pitch to midi converters struggle with unstable pitch, strong overtones, vibrato, etc. One option to help is <b>speedlim</b> that only outputs data at specified intervals
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Pitch</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orge0776b2" class="outline-4">
<h4 id="orge0776b2">page 155</h4>
<div class="outline-text-4" id="text-orge0776b2">
<p>
The modulo operator can be used to analyze pitch class to perhaps look at themes.
</p>
</div>
</div>
<div id="outline-container-orga3d6a5b" class="outline-4">
<h4 id="orga3d6a5b">page 156</h4>
<div class="outline-text-4" id="text-orga3d6a5b">
<p>
Intervals are used by subtracting midi note values from the previous note. The sign gives the direction. <b>abs</b> takes the absolute value if direction doesn't matter. Register can be found by dividing by 12 and subtracting an offset.
</p>
</div>
</div>
<div id="outline-container-orgaae6ea1" class="outline-4">
<h4 id="orgaae6ea1">page 157</h4>
<div class="outline-text-4" id="text-orgaae6ea1">
<p>
Harmonies can be analyzed by grouping notes played closely enough together as a chord instead of individual notes. <b>tresh</b> groups items into a list if they happen close together, then you can sort the list, compare intervals, and then compare those chords to a collection of known chords.
</p>
</div>
</div>
<div id="outline-container-orgf9c3d3c" class="outline-4">
<h4 id="orgf9c3d3c">page 161</h4>
<div class="outline-text-4" id="text-orgf9c3d3c">
<p>
<b>select</b> and <b>match</b> look for patterns. <b>past</b> and <b>peak</b> trigger when something gets too high, or remembers the highest respectively. The opposite of peak is <b>trough</b>
</p>
</div>
</div>
