org-roam/winkler98_compos_inter_music.org
*** page 164
    *histo* keeps track of certain numbers, and can be used to keep counts of pitches, or velocities, or whatever.
*** page 165+
    Caluclating a running average and comparing it to the previous average allows for tracking things like crescendo, diminuendo (via note velocity), ritardando, accelerando (via delta notes), articulation (comparing duration to delta notes)
*** page 172
    Listener objects can be very simple. It is then up to the composer to determine what the computer will do in response
** Chapter 7: Composer Objects
*** page 174
    composer objects embody the thought process, taste, and skill of a composer
*** page 175
    The logic in creating an algorithm does not make a composer's talents secondary. The rules of the system are no different than the rules of music theory and history. It is the imagination of the composer and interaction with a performer that can make the music interesting
*** page 176
    Again, it is not necessarily a one-to-one relationship with performer input and compositional outcomes. There could be a chain reaction, or effect data storage, or who knows!
    | Data|
*** page 176
    Listener objects can provide real-time data, often via midi. This can also be stored. Storage objects can also have predetermined data. Objects like *seq*, *table*, *coll*, and *detonate* can be used for this.
    There is also generated data produced by algorithms
    |Rowe's Types of Algorithms|
*** page 178
    Generative, Sequenced, and Transformative.
    - Generative :: methods that create music from stored fundamental material
    - Sequenced :: Use prerecorded fragments in response to real-time input
    - Transformative :: methods to take existing material and transform into variants, which may or may not be recognizable as coming from the original
*** pages 179-186
    Various objects to transform data:
    *split* *select* *range* *gate* *speedlim*
    |Automation and Delay|
*** pages 187- 190
    *delay* *line*
*** page 191
    Mapping can be useful to connect different aspects of performance to other aspects
*** page 210
    Humanizing algorithms: by using constrained random values, improvisation will be different each time, but have a consistent style
** Chapter 8: Sound Design
*** page 221
    Finding unique sounds, new ways to organize them or control them is the goal of computer music
*** page 225
    Timbre analysis not available in Max (in 1998 that is... not sure now)
*** page 257
    The addition of FFTs allow for more interactive options and looking at timbre
** Chapter 9: Score Objects: Compositional Strategies, Structures, and Timing Mechanisms
*** page 259
    Multitude of options for interactive music makes composing difficult. Technical possibilities are overwhelming
    What is needed is a strong aesthetic concept or voice that defines the purpose, mood, limits, and scope of the work
*** page 260
    The central question and difference from other modes of composition is what is the relationship between the computer and the performer? Who is following who?
*** page 261
Interactive works have many objects that need to be linked, enabled, disabled, reset, and reconfigured during a performance.
Score objects allow changing many different parameters all at once that would be cumbersome otherwise
*** page 264
    Number boxes can be useful to jump to a certain part of the score
    *switch* will wait for a certain event, then goes on to wait for the next one, and the next until all the events have happened.
*** page 266
    *match* is order specific, so it matches motives very well, but it has to be perfect
*** page 269
    objects that can trigger based on time are *timer*, *delay*, *pipe*, *clocker*, and *timeline* (perhaps replaced by transport?)
*** page 275
    *preset* does a lot for storing parameters and changing them quickly
*** page 284
    *follow* can be used to match a series of pitches that can then trigger other objects
*** page 291
    predetermined scores and algorithms allow for highly detailed, polished, and dependable works.
    indeterminacy offers freedom, spontaneity, dialog, and excitement of the unexpected
*** page 292
    - Predetermined score and predetermined computer sequences
      least interactive, perhaps should be performer and tape instead. Can be used to give the peformer more freedom in tempo
    - Predetermined score and indeterminant computer actions
    - Performer improvisation and Predetermined Computer sequences
