docs/site/winkler98_compos_inter_music.html
<div id="outline-container-orge4f6c27" class="outline-4">
<h4 id="orge4f6c27">page 164</h4>
<div class="outline-text-4" id="text-orge4f6c27">
<p>
<b>histo</b> keeps track of certain numbers, and can be used to keep counts of pitches, or velocities, or whatever.
</p>
</div>
</div>
<div id="outline-container-org04490ff" class="outline-4">
<h4 id="org04490ff">page 165+</h4>
<div class="outline-text-4" id="text-org04490ff">
<p>
Caluclating a running average and comparing it to the previous average allows for tracking things like crescendo, diminuendo (via note velocity), ritardando, accelerando (via delta notes), articulation (comparing duration to delta notes)
</p>
</div>
</div>
<div id="outline-container-org3c0c89a" class="outline-4">
<h4 id="org3c0c89a">page 172</h4>
<div class="outline-text-4" id="text-org3c0c89a">
<p>
Listener objects can be very simple. It is then up to the composer to determine what the computer will do in response
</p>
</div>
</div>
</div>
<div id="outline-container-org11ef8ec" class="outline-3">
<h3 id="org11ef8ec">Chapter 7: Composer Objects</h3>
<div class="outline-text-3" id="text-org11ef8ec">
</div>
<div id="outline-container-orge8751ab" class="outline-4">
<h4 id="orge8751ab">page 174</h4>
<div class="outline-text-4" id="text-orge8751ab">
<p>
composer objects embody the thought process, taste, and skill of a composer
</p>
</div>
</div>
<div id="outline-container-org6fdc5ee" class="outline-4">
<h4 id="org6fdc5ee">page 175</h4>
<div class="outline-text-4" id="text-org6fdc5ee">
<p>
The logic in creating an algorithm does not make a composer's talents secondary. The rules of the system are no different than the rules of music theory and history. It is the imagination of the composer and interaction with a performer that can make the music interesting
</p>
</div>
</div>
<div id="outline-container-org6bd0c77" class="outline-4">
<h4 id="org6bd0c77">page 176</h4>
<div class="outline-text-4" id="text-org6bd0c77">
<p>
Again, it is not necessarily a one-to-one relationship with performer input and compositional outcomes. There could be a chain reaction, or effect data storage, or who knows!
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Data</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgbc47eae" class="outline-4">
<h4 id="orgbc47eae">page 176</h4>
<div class="outline-text-4" id="text-orgbc47eae">
<p>
Listener objects can provide real-time data, often via midi. This can also be stored. Storage objects can also have predetermined data. Objects like <b>seq</b>, <b>table</b>, <b>coll</b>, and <b>detonate</b> can be used for this.
There is also generated data produced by algorithms
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Rowe's Types of Algorithms</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgb6bf028" class="outline-4">
<h4 id="orgb6bf028">page 178</h4>
<div class="outline-text-4" id="text-orgb6bf028">
<p>
Generative, Sequenced, and Transformative.
</p>
<dl class="org-dl">
<dt>Generative</dt><dd>methods that create music from stored fundamental material</dd>
<dt>Sequenced</dt><dd>Use prerecorded fragments in response to real-time input</dd>
<dt>Transformative</dt><dd>methods to take existing material and transform into variants, which may or may not be recognizable as coming from the original</dd>
</dl>
</div>
</div>
<div id="outline-container-org1448257" class="outline-4">
<h4 id="org1448257">pages 179-186</h4>
<div class="outline-text-4" id="text-org1448257">
<p>
Various objects to transform data:
<b>split</b> <b>select</b> <b>range</b> <b>gate</b> <b>speedlim</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Automation and Delay</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org76b2ef6" class="outline-4">
<h4 id="org76b2ef6">pages 187- 190</h4>
<div class="outline-text-4" id="text-org76b2ef6">
<p>
<b>delay</b> <b>line</b>
</p>
</div>
</div>
<div id="outline-container-org7faca36" class="outline-4">
<h4 id="org7faca36">page 191</h4>
<div class="outline-text-4" id="text-org7faca36">
<p>
Mapping can be useful to connect different aspects of performance to other aspects
</p>
</div>
</div>
<div id="outline-container-org732d2b6" class="outline-4">
<h4 id="org732d2b6">page 210</h4>
<div class="outline-text-4" id="text-org732d2b6">
<p>
Humanizing algorithms: by using constrained random values, improvisation will be different each time, but have a consistent style
</p>
</div>
</div>
</div>
<div id="outline-container-org91690c2" class="outline-3">
<h3 id="org91690c2">Chapter 8: Sound Design</h3>
<div class="outline-text-3" id="text-org91690c2">
</div>
<div id="outline-container-org2956175" class="outline-4">
<h4 id="org2956175">page 221</h4>
<div class="outline-text-4" id="text-org2956175">
<p>
Finding unique sounds, new ways to organize them or control them is the goal of computer music
</p>
</div>
</div>
<div id="outline-container-org61f9272" class="outline-4">
<h4 id="org61f9272">page 225</h4>
<div class="outline-text-4" id="text-org61f9272">
<p>
Timbre analysis not available in Max (in 1998 that is&#x2026; not sure now)
</p>
</div>
</div>
<div id="outline-container-org1c4b82a" class="outline-4">
<h4 id="org1c4b82a">page 257</h4>
<div class="outline-text-4" id="text-org1c4b82a">
<p>
The addition of FFTs allow for more interactive options and looking at timbre
</p>
</div>
</div>
</div>
<div id="outline-container-orga142984" class="outline-3">
<h3 id="orga142984">Chapter 9: Score Objects: Compositional Strategies, Structures, and Timing Mechanisms</h3>
<div class="outline-text-3" id="text-orga142984">
</div>
<div id="outline-container-org6227bf3" class="outline-4">
<h4 id="org6227bf3">page 259</h4>
<div class="outline-text-4" id="text-org6227bf3">
<p>
Multitude of options for interactive music makes composing difficult. Technical possibilities are overwhelming
What is needed is a strong aesthetic concept or voice that defines the purpose, mood, limits, and scope of the work
</p>
</div>
</div>
<div id="outline-container-orgbf981ec" class="outline-4">
<h4 id="orgbf981ec">page 260</h4>
<div class="outline-text-4" id="text-orgbf981ec">
<p>
The central question and difference from other modes of composition is what is the relationship between the computer and the performer? Who is following who?
</p>
</div>
</div>
<div id="outline-container-orgcfac01d" class="outline-4">
<h4 id="orgcfac01d">page 261</h4>
<div class="outline-text-4" id="text-orgcfac01d">
<p>
Interactive works have many objects that need to be linked, enabled, disabled, reset, and reconfigured during a performance.
Score objects allow changing many different parameters all at once that would be cumbersome otherwise
</p>
</div>
</div>
<div id="outline-container-org0919f64" class="outline-4">
<h4 id="org0919f64">page 264</h4>
<div class="outline-text-4" id="text-org0919f64">
<p>
Number boxes can be useful to jump to a certain part of the score
<b>switch</b> will wait for a certain event, then goes on to wait for the next one, and the next until all the events have happened.
</p>
</div>
</div>
<div id="outline-container-orgde0defa" class="outline-4">
<h4 id="orgde0defa">page 266</h4>
<div class="outline-text-4" id="text-orgde0defa">
<p>
<b>match</b> is order specific, so it matches motives very well, but it has to be perfect
</p>
</div>
</div>
<div id="outline-container-org8e2f2d1" class="outline-4">
<h4 id="org8e2f2d1">page 269</h4>
<div class="outline-text-4" id="text-org8e2f2d1">
<p>
objects that can trigger based on time are <b>timer</b>, <b>delay</b>, <b>pipe</b>, <b>clocker</b>, and <b>timeline</b> (perhaps replaced by transport?)
</p>
</div>
</div>
<div id="outline-container-org8d58b81" class="outline-4">
<h4 id="org8d58b81">page 275</h4>
<div class="outline-text-4" id="text-org8d58b81">
<p>
<b>preset</b> does a lot for storing parameters and changing them quickly
</p>
</div>
</div>
<div id="outline-container-orgb04801d" class="outline-4">
<h4 id="orgb04801d">page 284</h4>
<div class="outline-text-4" id="text-orgb04801d">
<p>
<b>follow</b> can be used to match a series of pitches that can then trigger other objects
</p>
</div>
</div>
<div id="outline-container-orge40b254" class="outline-4">
<h4 id="orge40b254">page 291</h4>
<div class="outline-text-4" id="text-orge40b254">
<p>
predetermined scores and algorithms allow for highly detailed, polished, and dependable works.
indeterminacy offers freedom, spontaneity, dialog, and excitement of the unexpected
</p>
</div>
</div>
<div id="outline-container-org7065823" class="outline-4">
<h4 id="org7065823">page 292</h4>
<div class="outline-text-4" id="text-org7065823">
<ul class="org-ul">
<li>Predetermined score and predetermined computer sequences
least interactive, perhaps should be performer and tape instead. Can be used to give the peformer more freedom in tempo</li>
<li>Predetermined score and indeterminant computer actions</li>
<li>Performer improvisation and Predetermined Computer sequences</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
